docs/projects/mtech.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>M.Tech Projects</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="content" class="content">
<ul class="sidebar" id="mySideNav">
  <a href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a href="../index.html">Home</a>
  <a href="../research-topics/_index.html">Research Topics</a>
  <a href="../publications.html">Publications</a>
  <a class="active" href="./_index.html">Projects</a>
  <a href="../bio.html">Bio</a>
</ul>

<div class="logo">
<a class="logo__link" title="Kanishak Vaidya" rel="home">
<div class="logo__item logo__text">
<div class="logo__title">Kanishak Vaidya</div>
<div class="logo__tagline">PhD fellow in IISc Bangalore</div>
</div></a>
<!-- div style="float:right;">
  <div class="toggle-light light" ></div >
</div-->
</div>

<script>
function myFunction() {
  var x = document.getElementById("mySideNav");
  if (x.className === "sidebar") {
    x.className += " responsive";
  } else {
    x.className = "sidebar";
  }
}
</script>

<div id="outline-container-org3d00d61" class="outline-2">
<h2 id="org3d00d61">Image Segmentation using Watershed Transform</h2>
<div class="outline-text-2" id="text-org3d00d61">
<ul class="org-ul">
<li>M.Tech 1st Semester</li>
<li>Team Size: 2</li>
<li>Software Used: MATLAB and Python</li>
</ul>
<p>
Implemented immersion simulations on grayscale images to segment different regions by using watershed transform.
</p>
</div>
</div>

<div id="outline-container-orgec376b4" class="outline-2">
<h2 id="orgec376b4">Image mosaic using homography estimation</h2>
<div class="outline-text-2" id="text-orgec376b4">
<ul class="org-ul">
<li>M.Tech 2nd Semester</li>
<li>Software used: MATLAB</li>
</ul>
<p>
Stiched five images taken of a subject from five different viewpoints to create a mosaic. Implemented SIFT matching from <code>vlfeat.org</code> and used homography estimation using normalization of scales to morph images to stich them in a mosaic.
</p>
</div>
</div>

<div id="outline-container-org366c51d" class="outline-2">
<h2 id="org366c51d">Finding rotation and translation direction using two images</h2>
<div class="outline-text-2" id="text-org366c51d">
<ul class="org-ul">
<li>M.Tech 2nd Semester</li>
<li>Software used: MATLAB</li>
</ul>
<p>
Computed the rotation and translation direction between two images using the Hartley normalization for the eight point algorithm. Matching points were computed using SIFT and outliers removed using RANSAC.
</p>
</div>
</div>
</div>
</body>
</html>
